app/controllers/comments_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "s"], ["body", "s"], ["product_id", 1], ["created_at", "2021-04-22 09:57:27.147055"], ["updated_at", "2021-04-22 09:57:27.147055"]]
---
    def create
        @pro = Product.find(params[:id])
        @comment = @pro.comments.create(comment_params)