app/controllers/products_controller.rb

INSERT INTO "products" ("name", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "book"], ["price", 120000.0], ["created_at", "2021-04-22 03:11:37.012941"], ["updated_at", "2021-04-22 03:11:37.012941"]]
---
  def create
    @product = Product.new(product_params)
    if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
  def show
    @pro = Product.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 21]]
---
  def destroy
    @pro = Product.find(params[:id])
    @pro.destroy

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @pro = Product.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["price", 1500000000.0], ["updated_at", "2021-04-22 14:13:54.931605"], ["id", 1]]
---
  def update
    @pro = Product.find(params[:id])

    if @pro.update(product_params)