app/views/products/show.html.erb

</table>
<%@pro.comments.each do |c|%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 1]]